#### AnalyticalElementSelector Enumeration

---

|  |
| --- |
| See Also |

Specifies a portion of an Analytical Element or the whole element.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum AnalyticalElementSelector ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration AnalyticalElementSelector ``` |

| Visual C++ |
| --- |
| ``` public enum class AnalyticalElementSelector ``` |

# Members

| Member name | Description |
| --- | --- |
| StartOrBase | Start or base of element (corresponds to end = 0). |
| EndOrTop | End or top of element (corresponds to end = 1). |
| Whole | Entire element |

# See Also

Autodesk.Revit.DB.Structure Namespace